{"sections":[{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"dsj52p3ork7k"}},"id":"1VDhyOEuYQEWAyKwEoAuoG","type":"Entry","createdAt":"2018-11-01T20:16:48.210Z","updatedAt":"2018-11-02T15:27:17.280Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":3,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"section"}},"locale":"en-US"},"fields":{"header":"Job Mechanics","modules":[{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"dsj52p3ork7k"}},"id":"1BEeIcgKOAOq0AGYuYASA","type":"Entry","createdAt":"2018-11-01T19:48:08.137Z","updatedAt":"2018-11-02T14:52:40.295Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":8,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"module"}},"locale":"en-US"},"fields":{"header":"Aetherflow && Faerie Gauge","moduleText":"### Aetherflow ![Aetherflow](//images.ctfassets.net/dsj52p3ork7k/xkOHWjLTXwkQAoEeiGiGo/2532033d52a17b81628810603852dd7a/aetherflow.png)\nUsing Aetherflow restores 10% of your MP and grants you three stacks of Aetherflow. Certain Actions will require and consume one stack. Consuming a stack reduces the cooldown of Aetherflow by five seconds. Make sure to use up your stacks in time to shorten the cooldown as much as possible.\n\nStacks granted by Dissipation will also lower the cooldown of Aetherflow by five seconds each.\n\n### Faerie Gauge ![Faerie Gauge](//images.ctfassets.net/dsj52p3ork7k/6cv6V1qEQ8QMI4AMkcgMKA/b3c3efe299fdb17c2f9df35f837d454c/faeriegauge.png)\n\nConsuming a single stack during combat increases your Faerie Gauge by 10. Gauge is used for Fey Union, which tethers your pet to your target and applies a powerful single-target regen while active. Your pet will not be able to move or perform any actions while Fey Union is active. Fey Union requires at least 10 gauge to activate. Fey Union consumes 10 gauge every tick (3 seconds). Fey Union will end if any of the following situation occur:\n\n1. Your gauge reaches zero.\n2. Your Fey Union'd target moves out of range (15 yalms). If this happens, your pet will stop all actions and your gauge will stop draining. If the targetted player moves back into range, the tether wil reapper and Fey union will resume.\n3. You order your pet to use a cooldown, like Whispering Dawn. Generic pet commands such as Place, Heel, Sic etc. and Embrace will not work.\n4. Your pet dies, you die, or you use Dissipate.\n\nYour gauge will reset to zero if you die. However it will not reset if your pet dies or is dissipated.\n\nAetherpact is the action performed by the Scholar on a party member, which commands your pet to use Fey Union on that player. Aetherpact has a range of 30 yalms, which means that your target must be within 30 yalms of the Scholar, not your fairy. Fey Union has a range of 15 yalms, which refers to the length of the tether. If the target is more than 15 yalms away from the pet when Aetherpact is used, your fairy will move towards the target until it is within range and then proceed to use Fey Union.\n\n"}}]}},{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"dsj52p3ork7k"}},"id":"5uErtKf9ug0qmSqGIWoIK","type":"Entry","createdAt":"2018-11-02T15:26:37.253Z","updatedAt":"2018-11-02T15:26:37.253Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":1,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"section"}},"locale":"en-US"},"fields":{"header":"Mechanical Quirks","modules":[{"sys":{"space":{"sys":{"type":"Link","linkType":"Space","id":"dsj52p3ork7k"}},"id":"26aIJKsdSQQeouuE6wOWmc","type":"Entry","createdAt":"2018-11-02T15:25:00.058Z","updatedAt":"2018-11-02T15:25:25.523Z","environment":{"sys":{"id":"master","type":"Link","linkType":"Environment"}},"revision":2,"contentType":{"sys":{"type":"Link","linkType":"ContentType","id":"module"}},"locale":"en-US"},"fields":{"header":"Mechanical Quirks","moduleText":"import {Timeline} from '../components/Timeline\n\n## MECHANICAL QUIRKS\nScholar is known for being a mechanically clunky job with many quirks not listed in your tooltips. Here are a few that you should be aware of.\n\n#### SHIELD DELAY\n<Timeline />\nIt takes about 1-2 seconds for Galvanize to actually apply, even though the icon appears immediately. In some situations, this can be useful. For example, you might want to cast Adloquium on a tank using Convalescence and buffed by Nature’s Minne to spread onto the rest of the party using Deployment Tactics. Due to shield delay, the Galvanize that you apply will not be immediately eaten by the next autoattack, giving you about two seconds to use Deployment Tactics on him.\n\n#### DOT / BUFF DELAY\nBuffs and debuffs have a delay between cast and application. This delay depends on your ping. Bio II has an especially long delay of about 1-2 seconds. Keep this in mind when trying to line up Chain Stratagem with raid buffs or using Bane.\n\n#### SACRED SOIL / SHADOW FLARE DELAY\nAs of patch 4.4, Sacred Soil and Shadow Flare apply instantly instead of on the next server tick.\n\n#### HEAL PROPAGATION\nEvery AoE healing action in this game is affected by heal propagation. When an AoE heal is cast, players are healed one by one rather than at the same time. Raidwide damage also propagates instead of hitting everyone at the same time. Combined with shield delay, this can result in certain players not being shielded in time. Make sure to cast your heals well in advance to prevent this. “Field” abilities such as Sacred Soil are not affected by this as they apply their mitigation immediately to all players.\n\n#### FAIRY INDEPENDENCE\nFairies are separate entities and can be commanded to cast their abilities even while you are casting something else.\n\n#### FAIRY INVULNERABILITY (SUCCOR DEPLOY)\nYour fairy is immune to most types of raidwide AoE damage. Thus, Galvanize will often remain on your fairy after the party takes raidwide damage, if you Galvanized the party beforehand. You can then use Deployment Tactics on your fairy to to spread your fairy’s Galvanize to the rest of the party, giving you another partywide Galvanize for free. This can be useful when having to deal with multiple raidwide AoEs in quick succession. Some potency numbers:\n\n#### Succor deploy = 150 (heal) + 225 (shield) + 225 (shield)\n\nDeployed Adloquium = 300 (shield, ~900 if it crits depending on how much crit you have)\n\n#### AUTO-EMBRACE AND MANUAL EMBRACE\nYour fairy will automatically cast Embrace on anyone below 80% HP. You can still force her to cast Embrace on targets above 80% HP by targeting them and using Embrace. You can use the following macros to make manually Embracing targets easier. Remember that <mo> macros still work when hovering over a player in the party list.\n\nTarget's Target macroTarget Off Tank macroMouseover macro\n\n#### EXCOGITATION EXPIRATION DELAY\nExcogitation will automatically trigger once its duration of 45 seconds elapses if your target does not drop below 50% HP. However, it takes about half a second for the heal to occur and for the buff’s icon to disappear. As the cooldown of Excogitation is also 45 seconds, it is possible to reapply Excogitation on your target just as it expires. If you do this too quickly, Excogitation will have no effect. Excogitation will still be put on cooldown and you will lose one stack of Aetherflow. Video example: https://clips.twitch.tv/SnappyLachrymosePhoneHassaanChop\n\n#### SHARED FAIRY COOLDOWNS\nIf you use a fairy ability and then summon your other fairy, the respective slot will still be on cooldown. For example, if you use Fey Wind on Selene (ability #4) and then summon Eos, Fey Illumination (ability #4) will also be on cooldown. However, the cooldown does not “scale”. Fey Wind has a cooldown of 60 seconds, so if you use it and immediately summon Eos Fey Illumination will be on cooldown for 60 seconds too, despite having an actual cooldown of 120 seconds.\n\n#### CRITICAL ADLOQUIUM\nAn Adloquium that crits shields for double the amount healed. This doubled shield can be spread using Deployment Tactics which results in an insanely strong partywide Galvanize. Shields provided by Succor are not doubled by critical hits.\n\n#### SHIELD OVERWRITE\nGalvanize will only be overwritten if the new shield is stronger than the previous one. The duration of the old shield will not be refreshed if it is not overwritten.\n\n#### PET SCALING\nYour fairy scales to about 70% of your own stats. Your fairy tooltips are thus inaccurate - the real potencies are about 70% of the advertised value."}}]}}],"title":"HomePage"}